# 201610969_고성용_과제

In [1]:
import pandas as pd

product_1 = pd.Series({'Price':'5.0', 'Product':'Sushi Roll','Product ID':'4109'})
product_2 = pd.Series({'Price':'0.5', 'Product':'Egg','Product ID':'1412'})
product_3 = pd.Series({'Price':'1.5', 'Product':'Bagel','Product ID':'8931'})

product_df = pd.DataFrame([product_1,product_2,product_3] )
product_df = product_df.set_index('Product ID')
product_df

           Price     Product
Product ID
4109         5.0  Sushi Roll
1412         0.5         Egg
8931         1.5       Bagel

In [2]:
invoice_1 = pd.Series({'Customer':'Ali', 'Product ID': '4109','Quantity': '1'})
invoice_2 = pd.Series({'Customer':'Eric', 'Product ID': '1412','Quantity': '12'})
invoice_3 = pd.Series({'Customer':'Ande', 'Product ID': '8931','Quantity': '6'})
invoice_4 = pd.Series({'Customer':'Sam', 'Product ID': '4109','Quantity': '2'})

invoice_df = pd.DataFrame([invoice_1,invoice_2,invoice_3,invoice_4])
invoice_df

  Customer Product ID Quantity
0      Ali       4109        1
1     Eric       1412       12
2     Ande       8931        6
3      Sam       4109        2

In [3]:
# OUTER JOIN
pd.merge(product_df,invoice_df, how='outer',left_on='Product ID', right_on='Product ID')

  Product ID Price     Product Customer Quantity
0       4109   5.0  Sushi Roll      Ali        1
1       4109   5.0  Sushi Roll      Sam        2
2       1412   0.5         Egg     Eric       12
3       8931   1.5       Bagel     Ande        6